# HW 2  total points 13

# Q1(2 Point): solve the following  problem using one line of code

find the product of square of number in x if x is odd
hint: use in built function **filter** too

In [14]:
%matplotlib inline
from functools import reduce
x = range(6)
# reduce(???)

## Q2(3 points):  Using  pandas series function solve following.
Please try to write just one line of code
- (point 1) print unique values on obj
- (Point 1) print count of  each value in obj
- (Point 1) plot the bar graph

In [10]:
import pandas as pd
obj = pd.Series(list('aabccc') * 3)
obj

0     a
1     a
2     b
3     c
4     c
5     c
6     a
7     a
8     b
9     c
10    c
11    c
12    a
13    a
14    b
15    c
16    c
17    c
dtype: object

# Q3(1 point ): replace each value in above series  as
Please  write just one line of code

**a by aa , b by bb and c by cc**

# Q4(3 points): Plot side by side bar graph for each categorical columns in folllowing DataFrame
Hint: use pd.value_counts too

In [23]:
data = pd.DataFrame({'A': [1, 3, 4, 3, 4],
                         'B': [2, 3, 1, 2, 3],
                         'C': [1, 5, 2, 4, 4]})
data

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

# Q5(4 points, 1 point each): Do the following on following dataFrame
- Convert date to datetime using pandas
- assign  Date column to index
- drop Date column
- interpolate NA value in Value column using time method

In [49]:
import numpy as np
data = pd.DataFrame({'Date':['2017-12-30', '2018-01-10' ,'2018-02-24' ,'2018-03-28' ,'2018-04-30'], 'Value':[1, 5, 9, np.nan,8]})
data

         Date  Value
0  2017-12-30    1.0
1  2018-01-10    5.0
2  2018-02-24    9.0
3  2018-03-28    NaN
4  2018-04-30    8.0